Table of Contents
 Interface IIdeaConcreteBlock
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public interface IIdeaConcreteBlock : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Height
Height
double Height { get; }
Property Value
double
 Lenght
Lenght
double Lenght { get; }
Property Value
double
 Material
Material of the concrete block.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Width
Width
double Width { get; }
Property Value
double
 Edit this page